import React, { useState } from "react";

export const InteriorDrive = ["Материал обивки салона - ткань"];

export const InteriorActiveLight = [
  "Материал обивки салона - ткань",
  "Кожаная оплетка руля и ручки КПП",
];
export const InteriorActiveHard = [
  "Материал обивки салона - ткань",
  "Кожаная оплетка руля и ручки КПП",
];

export const InteriorSupreme = [
  "Материал обивки салона - ткань",
  "Кожаная оплетка руля и ручки КПП",
];

export const ComfortDrive = [
  "Регулировка рулевой колонки по углу наклона и вылету",
  "Управление аудиосистемой на рулевом колесе",
  "Электрические стеклоподъемники передних и задних дверей",
  "Кондиционер",
  "Центральный замок с дистанционным управлением",
  "Подогрев передних сидений",
  "Сиденье водителя с регулировкой по высоте",
  "Боковые зеркала заднего вида с электроприводом и обогревом" <
    "Маршрутный компьютер",
  "Обогрев заднего стекла",
  "Электронный стояночный тормоз",
  "Автоматическая блокировка дверных замков при начале движения",
  "Регулировка угла наклона задних сидений",
];

export const ComfortActiveLight = [
  "Регулировка рулевой колонки по углу наклона и вылету",
  "Управление аудиосистемой на рулевом колесе",
  "Электрические стеклоподъемники передних и задних дверей",
  "Климат контроль (2 зоны)",
  "Центральный замок с дистанционным управлением",
  "Подогрев передних сидений",
  "Сиденье водителя с регулировкой по высоте",
  "Поясничная поддержка сиденья водителя",
  "Боковые зеркала заднего вида с электроприводом и обогревом",
  "Электропривод сложения боковых зеркал",
  "Круиз контроль",
  "Маршрутный компьютер",
  "Обогрев заднего стекла",
  "Электронный стояночный тормоз",
  "Автоматическое складывание боковых зеркал при блокировке дверей",
  "Автоматическая блокировка дверных замков при начале движения",
  "Регулировка угла наклона задних сидений",
  "Центральный информационный дисплей с HMI-коммандером",
];
export const ComfortActiveHard = [
  "Регулировка рулевой колонки по углу наклона и вылету",
  "Управление аудиосистемой на рулевом колесе",
  "Электрические стеклоподъемники передних и задних дверей",
  "Климат контроль (2 зоны)",
  "Центральный замок с дистанционным управлением",
  "Подогрев передних сидений",
  "Сиденье водителя с регулировкой по высоте",
  "Поясничная поддержка сиденья водителя",
  "Боковые зеркала заднего вида с электроприводом и обогревом",
  "Электропривод сложения боковых зеркал",
  "Круиз контроль",
  "Маршрутный компьютер",
  "Обогрев заднего стекла",
  "Электронный стояночный тормоз",
  "Автоматическое складывание боковых зеркал при блокировке дверей",
  "Автоматическая блокировка дверных замков при начале движения",
  "Регулировка угла наклона задних сидений",
  "Центральный информационный дисплей с HMI-коммандером",
];

export const ComfortSupreme = [
  "Регулировка рулевой колонки по углу наклона и вылету",
  "Управление аудиосистемой на рулевом колесе",
  "Электрические стеклоподъемники передних и задних дверей",
  "Климат контроль (2 зоны)",
  "Центральный замок с дистанционным управлением",
  "Система бесключевого доступа и запуска двигателя",
  "Подогрев передних сидений",
  "Сиденье водителя с регулировкой по высоте",
  "Поясничная поддержка сиденья водителя",
  "Боковые зеркала заднего вида с электроприводом и обогревом",
  "Электропривод сложения боковых зеркал",
  "Внутреннее зеркало заднего вида с функцией автоматического затемнения",
  "Датчик дождя",
  "Дополнительный экран над панелью приборов",
  "Датчики парковки спереди и сзади",
  "Камера заднего вида",
  "Круиз контроль",
  "Маршрутный компьютер",
  "Обогрев заднего стекла",
  "Электронный стояночный тормоз",
  "Система перезапуска двигателя i-stop",
  "Автоматическое складывание боковых зеркал при блокировке дверей",
  "Автоматическая блокировка дверных замков при начале движения",
  "Регулировка угла наклона задних сидений",
  "Центральный информационный дисплей с HMI-коммандером",
];

export const SafetyDrive = [
  "ABS - антиблокировочная тормозная система",
  "EBD - электронная система распределения тормозных усилий",
  "EBA - электронная система усиления экстренного торможения",
  "DSC - система динамической стабилизации",
  "TCS - противобуксовочная система",
  "TPMS - Cистема контроля давления в шинах",
  "Фронтальные и боковые подушки безопасности",
  "Боковые шторки безопасности",
  "Иммобилайзер",
  "Система Isofix",
  "Регулируемые по высоте передние ремни безопасности",
  "G-Vectoring Control Plus",
  "Система Эра-Глонасс",
];

export const SafetyActiveLight = [
  "ABS - антиблокировочная тормозная система",
  "EBD - электронная система распределения тормозных усилий",
  "EBA - электронная система усиления экстренного торможения",
  "DSC - система динамической стабилизации",
  "TCS - противобуксовочная система",
  "TPMS - Cистема контроля давления в шинах",
  "Фронтальные и боковые подушки безопасности",
  "Боковые шторки безопасности",
  "Иммобилайзер",
  "Система Isofix",
  "Регулируемые по высоте передние ремни безопасности",
  "G-Vectoring Control Plus",
  "Система Эра-Глонасс",
];

export const SafetyActiveHard = [
  "ABS - антиблокировочная тормозная система",
  "EBD - электронная система распределения тормозных усилий",
  "EBA - электронная система усиления экстренного торможения",
  "DSC - система динамической стабилизации",
  "TCS - противобуксовочная система",
  "TPMS - Cистема контроля давления в шинах",
  "Фронтальные и боковые подушки безопасности",
  "Боковые шторки безопасности",
  "Иммобилайзер",
  "Система Isofix",
  "Регулируемые по высоте передние ремни безопасности",
  "G-Vectoring Control Plus",
  "Система Эра-Глонасс",
];

export const SafetySupreme = [
  "ABS - антиблокировочная тормозная система",
  "EBD - электронная система распределения тормозных усилий",
  "EBA - электронная система усиления экстренного торможения",
  "DSC - система динамической стабилизации",
  "TCS - противобуксовочная система",
  "SCBS (впереди) - Система безопасного торможения в городе",
  "TPMS - Cистема контроля давления в шинах",
  "Фронтальные и боковые подушки безопасности",
  "Боковые шторки безопасности",
  "Иммобилайзер",
  "Система Isofix",
  "Регулируемые по высоте передние ремни безопасности",
  "TSR - система распознавания дорожных знаков (необходима навигация)",
  "G-Vectoring Control Plus",
  "Система Эра-Глонасс",
];

export const LightingDevicesDrive = [
  "Омыватель фар",
  "Галогеновые ходовые огни",
  "Светодиодные фары (LED) ",
];

export const LightingDevicesActiveLight = [
  "Светодиодные фары (LED)",
  "Омыватель фар",
  "Светодиодные противотуманные фары (LED)",
  "Галогеновые ходовые огни",
];

export const LightingDevicesActiveHard = [
  "Светодиодные фары (LED)",
  "Омыватель фар",
  "Светодиодные противотуманные фары (LED)",
  "Галогеновые ходовые огни",
];

export const LightingDevicesSupreme = [
  "Светодиодные фары (LED)",
  "Омыватель фар",
  "Светодиодные противотуманные фары (LED)",
  "Светодиодные дневные ходовые огни",
  "AFLS - адаптивная система освещения",
];

export const WheelsAndTiresDrive = [
  "Малоразмерное запасное колесо",
  "Стальные колесные диски c колпаками, с шинами 225/65 R17",
];

export const WheelsAndTiresActiveLight = [
  "Малоразмерное запасное колесо",
  "Легкосплавные колесные диски с шинами 225/65 R17 ",
];

export const WheelsAndTiresActiveHard = [
  "Малоразмерное запасное колесо",
  "Легкосплавные колесные диски с шинами 225/65 R17 ",
];

export const WheelsAndTiresSupreme = [
  "Малоразмерное запасное колесо",
  "Легкосплавные колесные диски 225/55 R19 Silver",
];

export const AudioDrive = ["AUX, USB (2 спереди)", "Аудиосистема 4 динамика"];

export const AudioActiveHard = [
  "Bluetooth",
  "AUX, USB (2 спереди)",
  "Аудиосистема 6 динамиков",
  "Apple CarPlay© & Android Auto©",
  "Беспроводной Apple CarPlay©",
];

export const AudioActiveLight = [
  "Bluetooth",
  "AUX, USB (2 спереди)",
  "Аудиосистема 6 динамиков",
  "Apple CarPlay© & Android Auto©",
  "Беспроводной Apple CarPlay©",
];

export const AudioSupreme = [
  "Bluetooth",
  "AUX, USB (2 спереди)",
  "Аудиосистема 6 динамиков",
  "Apple CarPlay© & Android Auto©",
  "Беспроводной Apple CarPlay©",
];
