export default [
  {
    title: "АЛАРМ-МОТОРС ",
    descr: "  Россия, Санкт-Петербург, Выборгское шоссе, д.27, корп.1",
    number: "+ 7 (812) 565 48 69",
    website: "https://www.mazda-alarm-motors.ru/",
    coords: [60.060447, 30.306103],
  },
  {
    title: "РОЛЬФ ЛАХТА",
    descr: "   197374, г. Санкт-Петербург, ул. Савушкина, д.103Б",
    number: "  8 (812) 561 02 60",
    website: "https://rolflahta-mazda.ru/",
    coords: [59.985034, 30.245683],
  },
  {
    title: "ЕВРОСИБ-АВТО ОБВОДНЫЙ ",
    descr:
      "192007, Россия, Санкт-Петербург, Набережная Обводного канала д.72, стр.1",
    number: " +7 (812) 740 20 00",
    website: "https://www.mazdaspb.ru/",
    coords: [59.911773, 30.332676],
  },
  {
    title: "ЕВРОСИБ-АВТО ПУЛКОВО ",
    website: "https://www.mazdaspb.ru/",
    descr: "  196158, Россия, Санкт-Петербург, Пулковское шоссе 36, корпус 3а",
    number: " +7 (812) 740 20 00",
    coords: [59.820589, 30.324833],
  },
];
