import React, { useState } from "react";

export const InteriorDrive = ["Материал обивки салона - ткань"];

export const InteriorActive = [
  "Материал обивки салона - ткань",
  "Кожаная оплетка руля и ручки КПП",
];

export const InteriorSupremePlus = [
  "Материал обивки салона - кожа",
  "Кожаная оплетка руля и ручки КПП",
  "Отделка внутренних панелей дверей искусственной кожей",
];

export const ComfortDrive = [
  "Регулировка рулевой колонки по углу наклона и вылету",
  "Электрические стеклоподъемники передних и задних дверей",
  "Климат контроль (2 зоны)",
  "Центральный замок с дистанционным управлением",
  "Подогрев передних сидений",
  "Боковые зеркала заднего вида с электроприводом и обогревом",
  "Маршрутный компьютер",
  "Датчик уровня омывающей жидкости",
  "Электронный стояночный тормоз",
  "Автоматическая блокировка дверных замков при начале движения",
];

export const ComfortActive = [
  "Регулировка рулевой колонки по углу наклона и вылету",
  "Электрические стеклоподъемники передних и задних дверей",
  "Климат контроль (2 зоны)",
  "Центральный замок с дистанционным управлением",
  "Подогрев передних сидений",
  "Боковые зеркала заднего вида с электроприводом и обогревом",
  "Электропривод сложения боковых зеркал",
  "Внутреннее зеркало заднего вида с функцией автоматического затемнения",
  "Датчик света",
  "Датчик дождя",
  "Круиз контроль",
  "Дефлекторы системы вентиляции для задних пассажиров",
  "Маршрутный компьютер",
  "Датчик уровня омывающей жидкости",
  "Электронный стояночный тормоз",
  "Автоматическое складывание боковых зеркал при блокировке дверей",
  "Автоматическая блокировка дверных замков при начале движения",
  "Центральный информационный дисплей с HMI-коммандером",
];

export const ComfortSupremePlus = [
  "Регулировка рулевой колонки по углу наклона и вылету",
  "Электрические стеклоподъемники передних и задних дверей",
  "Климат контроль (2 зоны)",
  "Центральный замок с дистанционным управлением",
  "Подогрев передних сидений",
  "Боковые зеркала заднего вида с электроприводом и обогревом",
  "Электропривод сложения боковых зеркал",
  "Внутреннее зеркало заднего вида с функцией автоматического затемнения",
  "Датчик света",
  "Датчик дождя",
  "Датчики парковки спереди и сзади",
  "Камера заднего вида с динамической разметкой",
  "Круиз контроль",
  "Дефлекторы системы вентиляции для задних пассажиров",
  "Маршрутный компьютер",
  "Датчик уровня омывающей жидкости",
  "Электронный стояночный тормоз",
  "Система перезапуска двигателя i-stop",
  "Подогрев рулевого колеса",
  "Подогрев зоны щёток",
  "Проекционный экран на лобовом стекле",
  "Электропривод передних сидений с памятью для водителя",
  "Автоматическое складывание боковых зеркал при блокировке дверей",
  "Автоматическая блокировка дверных замков при начале движения",
  "Центральный информационный дисплей с HMI-коммандером",
];

export const SafetyDrive = [
  "ABS - антиблокировочная тормозная система",
  "EBD - электронная система распределения тормозных усилий",
  "EBA - электронная система усиления экстренного торможения",
  "DSC - система динамической стабилизации",
  "TCS - противобуксовочная система",
  "TPMS - Cистема контроля давления в шинах",
  "Фронтальные и боковые подушки безопасности",
  "Боковые шторки безопасности",
  "Иммобилайзер",
  "G-Vectoring Control Plus",
  "Система Эра-Глонасс",
];

export const SafetyActive = [
  "ABS - антиблокировочная тормозная система",
  "EBD - электронная система распределения тормозных усилий",
  "EBA - электронная система усиления экстренного торможения",
  "DSC - система динамической стабилизации",
  "TCS - противобуксовочная система",
  "TPMS - Cистема контроля давления в шинах",
  "Фронтальные и боковые подушки безопасности",
  "Боковые шторки безопасности",
  "Иммобилайзер",
  "G-Vectoring Control Plus",
  "Система Эра-Глонасс",
];

export const SafetySupremePlus = [
  "ABS - антиблокировочная тормозная система",
  "EBD - электронная система распределения тормозных усилий",
  "EBA - электронная система усиления экстренного торможения",
  "DSC - система динамической стабилизации",
  "TCS - противобуксовочная система",
  "TPMS - Cистема контроля давления в шинах",
  "Фронтальные и боковые подушки безопасности",
  "Боковые шторки безопасности",
  "Иммобилайзер",
  "G-Vectoring Control Plus",
  "Система Эра-Глонасс",
];

export const LightingDevicesDrive = [
  "Омыватель фар",
  "Галогеновые ходовые огни",
  "Светодиодные фары (LED) с функцией противотуманных фар",
];

export const LightingDevicesActive = [
  "Омыватель фар",
  "Галогеновые ходовые огни",
  "Светодиодные фары (LED) с функцией противотуманных фар",
];

export const LightingDevicesSupremePlus = [
  "Омыватель фар",
  "Галогеновые ходовые огни",
  "AFLS - адаптивная система освещения",
  "Светодиодные фары (LED) с функцией противотуманных фар",
];

export const WheelsAndTiresDrive = [
  "Малоразмерное запасное колесо",
  "Легкосплавные колесные диски с шинами 225/55 R17 Silver",
];

export const WheelsAndTiresActive = [
  "Малоразмерное запасное колесо",
  "Легкосплавные колесные диски с шинами 225/55 R17 Silver",
];

export const WheelsAndTiresSupremePlus = [
  "Малоразмерное запасное колесо",
  "Легкосплавные колесные диски с шинами 225/45 R19 Bright",
];

export const AudioDrive = ["AUX, USB (2 спереди)", "Аудиосистема 4 динамика"];

export const AudioActive = [
  "Bluetooth",
  "AUX, USB (2 спереди)",
  "Аудиосистема 6 динамиков",
  "Apple CarPlay© & Android Auto©",
  "Беспроводной Apple CarPlay©",
];

export const AudioSupremePlus = [
  "Bluetooth",
  "AUX, USB (2 спереди)",
  "Аудиосистема 6 динамиков",
  "Apple CarPlay© & Android Auto©",
  "Беспроводной Apple CarPlay©",
  "Радио AM/FM (RDS), 6 динамика, CD-чейнджер, с функцией MP3",
];
